WildernessLabs/Netduino_SDK/NetMF4_4/DeviceCode/Targets/Native/STM32F7/DeviceCode/STM32F7_USB/STM32F7_usb_functions.cpp
    // enable USB clock
    if( STM32F7_USB_IS_HS( Controller ) )
    { // HS on AHB1
        RCC->AHB1ENR |= RCC_AHB1ENR_OTGHSEN;
        // this is needed to enable the FS phy clock when the CPU is sleeping
        RCC->AHB1LPENR &= ~RCC_AHB1LPENR_OTGHSULPILPEN;
    }
    else
    { // FS on AHB2
        RCC->AHB2ENR |= RCC_AHB2ENR_OTGFSEN;
    }

    USB_CONTROLLER_STATE *State = &STM32F7_USB_ControllerState[ STM32F7_USB_IDX( Controller ) ].state;

    OTG_TypeDef* OTG = STM32F7_USB_REGS( Controller );

    GLOBAL_LOCK( irq );

    // Detach usb port for a while to enforce re-initialization
    OTG->DCTL = OTG_DCTL_SDIS; // soft disconnect

    OTG->GAHBCFG = OTG_GAHBCFG_TXFELVL;     // int on TxFifo completely empty, int off
    OTG->GUSBCFG = OTG_GUSBCFG_FDMOD        // force device mode
                 | STM32F7_USB_TRDT << 10   // turnaround time
                 | OTG_GUSBCFG_PHYSEL       // internal PHY
                 | OTG_GUSBCFG_PHYLPCS;     // 48MHz PHY clock

    OTG->GCCFG |= OTG_GCCFG_PWRDWN;        // transceiver enabled

    OTG->DCFG |= OTG_DCFG_DSPD;           // device speed = HS

// UNDONE: FIXME:
    if( STM32F7_USB_USE_VB_PIN( Controller ))
	{
        OTG->GCCFG |= OTG_GCCFG_VBDEN;         // enable vbus sense
	}
    if (!STM32F7_USB_USE_ID_PIN(Controller)) { // no ID pin
        OTG->GOTGCTL |= OTG_GOTGCTL_BVALOEN    // B-peripheral session valid override enable
                      | OTG_GOTGCTL_BVALOVAL;  // B-peripheral session valid override value
    }

    // setup usb state variables
    ( ( STM32F7_USB_STATE* )State )->pinsProtected = TRUE;
    State->EndpointStatus = ( ( STM32F7_USB_STATE* )State )->endpointStatus;
    State->EndpointCount = USB_MAX_EP( Controller );
    //State->DeviceStatus = USB_STATUS_DEVICE_SELF_POWERED;

    // get max ep0 packet size from actual configuration
    const USB_DEVICE_DESCRIPTOR* desc = ( USB_DEVICE_DESCRIPTOR* )USB_FindRecord( State, USB_DEVICE_DESCRIPTOR_MARKER, 0 );
    State->PacketSize = desc ? desc->bMaxPacketSize0 : DEF_EP0_SIZE;

    // use defaults for unused endpoints
    int idx;
    for( idx = 1; idx < State->EndpointCount; idx++ )
    {
        State->IsTxQueue[ idx ] = FALSE;
        State->MaxPacketSize[ idx ] = USB_MAX_DATA_PACKET_SIZE;  // 64
    }
    UINT32 epType = 0; // set all endpoints to unused
    UINT32 queueIdx = STM32F7_USB_IDX( Controller ) ? USB_MAX_EP( 0 ) - 1 : 0; // first queue buffer

    // get endpoint configuration
    const USB_ENDPOINT_DESCRIPTOR  *ep = NULL;
    const USB_INTERFACE_DESCRIPTOR *itfc = NULL;
    while( USB_NextEndpoint( State, ep, itfc ) )
    {
        // Figure out which endpoint we are initializing
        idx = ep->bEndpointAddress & 0x7F;

        // Check interface and endpoint numbers against hardware capability
        if( idx >= State->EndpointCount || itfc->bInterfaceNumber > 3 )
            return S_FALSE;

        if( ep->bEndpointAddress & 0x80 )
            State->IsTxQueue[ idx ] = TRUE;

        // Set the maximum size of the endpoint hardware FIFO
        int endpointSize = ep->wMaxPacketSize;

        // If the endpoint maximum size in the configuration list is bogus
        if( endpointSize != 8 && endpointSize != 16 && endpointSize != 32 && endpointSize != 64 )
            return S_FALSE;

        State->MaxPacketSize[ idx ] = endpointSize;

        // assign queues
        QueueBuffers[ queueIdx ].Initialize( );           // Clear queue before use
        State->Queues[ idx ] = &QueueBuffers[ queueIdx ];  // Attach queue to endpoint
        queueIdx++;

        // *****************************************
        // iso endpoints are currently not supported
        // *****************************************
        if( ( ep->bmAttributes & 3 ) == USB_ENDPOINT_ATTRIBUTE_ISOCHRONOUS )
            return FALSE;

        // remember endpoint types
        epType |= ( ep->bmAttributes & 3 ) << ( idx * 2 );
    }

    // If no endpoints were initialized, something is seriously wrong with the configuration list
    if( epType == 0 )
        return S_FALSE;

    ( ( STM32F7_USB_STATE* )State )->EP_Type = epType;

    HAL_Time_Sleep_MicroSeconds( 1000 ); // asure host recognizes reattach

    // setup hardware
    CPU_USB_ProtectPins( Controller, FALSE );
    if( STM32F7_USB_IS_HS( Controller ) )
    { // HS
        CPU_INTC_ActivateInterrupt( OTG_HS_IRQn, STM32F7_USB_Driver_HS_Interrupt, 0 );
        CPU_INTC_ActivateInterrupt( OTG_HS_WKUP_IRQn, STM32F7_USB_Driver_HS_Interrupt, 0 );
    }
    else
    { // FS
        CPU_INTC_ActivateInterrupt( OTG_FS_IRQn, STM32F7_USB_Driver_FS_Interrupt, 0 );
        CPU_INTC_ActivateInterrupt( OTG_FS_WKUP_IRQn, STM32F7_USB_Driver_FS_Interrupt, 0 );
    }

    // allow interrupts
    OTG->GINTSTS = 0xFFFFFFFF;           // clear all interrupts
    OTG->GINTMSK = OTG_GINTMSK_USBRST;   // enable reset only
    OTG->DIEPEMPMSK = 0;                 // disable Tx FIFO empty interrupts
    OTG->GAHBCFG |= OTG_GAHBCFG_GINTMSK; // gloabl interrupt enable

    // rest of initializations done in reset interrupt handler

    USB_Debug( '*' );

    return S_OK;
}

HRESULT CPU_USB_Uninitialize( int Controller )
{
    if( STM32F7_USB_IS_HS( Controller ) )
    { // HS
        CPU_INTC_DeactivateInterrupt( OTG_HS_WKUP_IRQn );
        CPU_INTC_DeactivateInterrupt( OTG_HS_IRQn );
    }
    else
    { // FS
        CPU_INTC_DeactivateInterrupt( OTG_FS_WKUP_IRQn );
        CPU_INTC_DeactivateInterrupt( OTG_FS_IRQn );
    }

    CPU_USB_ProtectPins( Controller, TRUE );

    // disable USB clock
    if( STM32F7_USB_IS_HS( Controller ) )
    { // HS on AHB1
        RCC->AHB1ENR &= ~RCC_AHB1ENR_OTGHSEN;
    }
    else
    { // FS on AHB2
        RCC->AHB2ENR &= ~RCC_AHB2ENR_OTGFSEN;
    }

    return S_OK;
}

BOOL CPU_USB_StartOutput( USB_CONTROLLER_STATE* State, int ep )
{
    if( State == NULL || ep >= State->EndpointCount )
        return FALSE;

    OTG_TypeDef* OTG = STM32F7_USB_REGS( State->ControllerNum );

    USB_Debug( 't' );

    GLOBAL_LOCK( irq );

    // If endpoint is not an output
    if( State->Queues[ ep ] == NULL || !State->IsTxQueue[ ep ] )
        return FALSE;

    /* if the halt feature for this endpoint is set, then just clear all the characters */
    if( State->EndpointStatus[ ep ] & USB_STATUS_ENDPOINT_HALT )
    {
        while( USB_TxDequeue( State, ep, TRUE ) != NULL )
        {
        } // clear TX queue

